#define  _CRT_SECURE_NO_WARNINGS

#include<stdio.h>

//算术操作符
//int main()
//{
//	int a = 7 % 2;
//	int b = 7 / 2;
//	
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}
//取模操作符的两端必须是整数


//移位操作符

//整数的二进制表示有3种
//原码
//反码
//补码

//正的整数的原码、反码、补码相同
//负的整数的原码、反码、补码是要计算的
//
//7
//00000000000000000000000000000111  原码
//00000000000000000000000000000111  反码
//00000000000000000000000000000111  补码

//-7
//10000000000000000000000000000111  原码
//11111111111111111111111111111000  反码(原码的符号位不变，其他位按位取反就是反码)
//11111111111111111111111111111001  补码(反码+1就是补码)

//整数在内存中存储的是补码

//int main()
//{
//	int a = -7;
//
//	//左移操作符
//	//移动的是二进制位
//	//整体左移然后补0
//
//	//int b = a << 1;
//
//	int b = a >> 1;
//
//
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//右移操作符
//算术移位:右边丢弃，左边补原符号位
//逻辑移位:右边丢弃，左边补0

//vs采用的是算术右移

//位操作符
//& 按(二进制)位与
//| 按(二进制)位或
//^ 按(二进制)位异或 - 相同为0，相异为1

//int main()
//{
//	int a = 3;
//	int b = -5;
//	//int c = a & b;
//	//int c = a | b;
//	int c = a ^ b;
//
//	printf("c=%d\n", c);
//
//	return 0;
//}

//不能创建临时变量（第三个变量），实现两个数的交换
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前: a = %d b = %d\n", a, b);
//
//	a = a + b;
//	b = a - b;
//	a = a - b;
//
//	printf("交换后: a = %d b = %d\n", a, b);
//
//	return 0;
//}

//3^3 = 0 -> a^a=0
//011
//011
//000
//0^5 = 5 -> 0^a=a
//000
//101
//101

//3^3^5 = 5
//3^5^3 = 5
//->异或操作符支持交换律
//011
//101
//110
//011
//101

//int main()
//{
//	int a = -3;
//	int b = -5;
//
//	printf("交换前: a = %d b = %d\n", a, b);
//
//	a = a ^ b;//a=3^5
//	b = a ^ b;//3^5^5 --> b=3
//	a = a ^ b;//3^5^3 --> a=5
//
//	printf("交换后: a = %d b = %d\n", a, b);
//
//	return 0;
//}

//编写代码实现:求一个整数存储在内存中的二进制中1的个数
//求补码的二进制中1的个数
//
// int a = 3
//000000000000000000000000000000000011


//赋值操作符

//单目操作符
//! 逻辑反操作
//- 负值
//+ 正值
//& 取地址
//sizeof 操作数的类型长度(以字节为单位)
//~ 对一个数的二进制按位取反
//++ 前置、后置++
//-- 前置、后置--
//*  间接访问操作符(解引用操作符)
//(类型) 强制类型转换

//int main()
//{
//	int flag = 3;
//	//flag为真，进入if
//	if (flag)
//	{}
//
//	//flag为假，进入if
//	if (!flag)
//	{}
//
//	int a = -10;
//	int b = +a;
//	int c = -a;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	printf("%d\n", c);
//
//	a = 10;
//	printf("%p\n", &a);
//	int* p = &a;//p就是指针变量
//
//	return 0;
//}
//C语言中0表示假，非0表示真


//int main()
//{
//	int a = 10;
//	int n = sizeof(a);
//	int c = sizeof(int);
//	//sizeof是一个操作符
//	//计算的是变量所占内存空间的大小，单位是字节
//	//计算类型所创建的变量占据空间的大小，单位是字节
//
//	printf("n=%d\n", n);
//	printf("c=%d\n", c);
//
//	int b[5] = { 0 };
//	printf("%d\n", sizeof(b));
//
//	return 0;
//}


//int main()
//{
//	//int a = 0;
//	//~是按二进制位取反
//	//00000000000000000000000000000000 -补码
//	//11111111111111111111111111111111 ~a
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001
//	//-1
//	//printf("%d\n", ~a);
//
//
//	int b = 3;
//	printf("%d\n", ~b);
//	//00000000000000000000000000000011
//	//11111111111111111111111111111100
//	//11111111111111111111111111111011
//	//10000000000000000000000000000100
//	//-4
//
//	int a = 13;
//	a |= (1 << 4 );
//	printf("%d\n", a);//a=29
//
//	a &= (~(1 << 4));
//	printf("%d\n", a);//a=13
//	//00000000000000000000000000011101
//	//把第五位的1置为0
//	//11111111111111111111111111101111 按位与
//	//00000000000000000000000000001101
//
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000 按位取反得到上面 1<<4
//
//
//	//00000000000000000000000000001101
//	//把第二位的0置为1/把第五位的0置1
//	//00000000000000000000000000000010 按位或 1<<1 00000000000000000000000000010000 按位或 1<<4
//	//00000000000000000000000000001111   00000000000000000000000000011101
//
//	return 0;
//}

//int main()
//{
//	//int a = 3;
//	//int b = ++a;//前置++ ，先++，后使用
//	////a=a+1,b=a;
//	//printf("%d\n", a);//4
//	//printf("%d\n", b);//4
//
//	//int b = a++;//后置++ ，先使用，后++
//	////b=a,a=a+1;
//	//printf("%d\n", a);//4
//	//printf("%d\n", b);//3
//
//
//	//int c = 3;
//	//int d = --c;//前置-- 先--，后使用
//	////c=c-1,d=c;
//	//printf("%d\n", c);//2
//	//printf("%d\n", d);//2
//
//	int c = 3;
//	int d = c--;//后置-- 先使用，后--
//	//d=c,c=c-1;
//	printf("%d\n", c);//2
//	printf("%d\n", d);//3
//
//
//	int a = 10;
//	printf("%d\n", a--);//10
//	printf("%d\n", a);//9
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//	printf("%d\n", a);
//	printf("%d\n", *p);
//
//	return 0;
//}


//int main()
//{
//	//time_t; long long
//	srand((unsigned int)time(NULL));
//	int a = (int)3.14;
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//
//	printf("%d\n", sizeof a);//ok
//
//	//printf("%d\n", sizeof int);//err
//	
//	return 0;
//}

//sizeof是操作符，不是函数
//strlen是库函数，是用来求字符串长度

//关系操作符
// > >= < <= != == 


//逻辑操作符
// && 逻辑与
// || 逻辑或


//int main()
//{
//	int a = -3;
//	int b = 0;
//	//int c = a && b; //并且
//	int c = a || b; //或
//	printf("%d\n", c);
//
//	return 0;
//}

//1.能被4整除，并且不能被100整除
//2.能被400整除是闰年

//is_leap_year(int y)
//{
//	if (((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0))
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//int main()
//{
//	return 0;
//}

//&& 左边为假，右边就不计算了
//|| 左边为真，右边就不计算了

//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//先使用a 再++ a为0，&&后的语句不再执行
//
//	i = a++ || ++b || d++;//先使用a 再++ a为1， ||后的语句不再执行
//
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//
//	return 0;
//}

//条件操作符（三目操作符）
//表达式1 ？ 表达式2 ： 表达式3
//  真			√			×
//  假			×			√

//逗号表达式
//逗号表达式，从左向右依次执行。整个表达式的结果是最后一个表达式的结果。

//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//	printf("c=%d\n", c);
//
//	return 0;
//}

//下标引用、函数调用和结构成员

//下标引用操作符[]
//int main()
//{
//	int arr[10] = { 0 };
//
//	arr[7] = 8;
//	7[arr] = 9;//印证了[]就是操作符 满足操作数之间的交换
//
//	// [] arr 7
//	// 3 + 5;
//	// 5 + 3;
//
//	return 0;
//}

//int Add(int x, int y)
//{
//	return x + y;
//}

//()函数调用操作符
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = Add(a, b);//()函数调用操作符，操作数：Add,a,b
//
//	return 0;
//}

//访问一个结构的成员
//. 结构体.成员名
//-> 结构体指针->成员名

struct Stu
{
	char name[20];
	int age;
	double score;
};

#include <string.h>

void set_stu(struct Stu* ps)
{
	//strcpy((*ps).name, "zhangsan");
	//(*ps).age = 20;
	//(*ps).score = 100.0;

	strcpy(ps->name, "zhangsan");  //结构体指针->成员名
	ps->age = 20;
	ps->score = 100.0;
}

void print_stu(struct Stu ss)
{
	printf("%s %d %lf\n", ss.name, ss.age, ss.score); //结构体.成员名
}

int main()
{
	struct Stu s = { 0 };
	set_stu(&s);
	print_stu(s);

	return 0;
}